src/Backend/jmeter/results/load-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 860,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.146511627906973,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 141.0,
    "pct1ResTime" : 24.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 120.0,
    "throughput" : 44.118401477453446,
    "receivedKBytesPerSec" : 37.70208576476171,
    "sentKBytesPerSec" : 25.777182033294004
  },
  "10 GET Список досок" : {
    "transaction" : "10 GET Список досок",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.6000000000000005,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 9.990000000000009,
    "throughput" : 10.405285885229697,
    "receivedKBytesPerSec" : 19.30998525375891,
    "sentKBytesPerSec" : 5.865167004838458
  },
  "13 GET Профиль пользователя" : {
    "transaction" : "13 GET Профиль пользователя",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.224999999999997,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 10.960000000000036,
    "throughput" : 10.41124414367517,
    "receivedKBytesPerSec" : 4.637273880791255,
    "sentKBytesPerSec" : 5.929528891202499
  },
  "02 POST Вход" : {
    "transaction" : "02 POST Вход",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 57.25000000000001,
    "medianResTime" : 57.0,
    "minResTime" : 55.0,
    "maxResTime" : 59.0,
    "pct1ResTime" : 58.900000000000006,
    "pct2ResTime" : 59.0,
    "pct3ResTime" : 59.0,
    "throughput" : 1.053740779768177,
    "receivedKBytesPerSec" : 1.0725722800316122,
    "sentKBytesPerSec" : 0.6799406447576396
  },
  "11 POST Создание доски" : {
    "transaction" : "11 POST Создание доски",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.67,
    "medianResTime" : 22.0,
    "minResTime" : 18.0,
    "maxResTime" : 47.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 27.0,
    "pct3ResTime" : 36.930000000000064,
    "throughput" : 10.398253093480296,
    "receivedKBytesPerSec" : 7.073198421415202,
    "sentKBytesPerSec" : 6.785367870697722
  },
  "03 POST Создание группы (подготовка)" : {
    "transaction" : "03 POST Создание группы (подготовка)",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 20.899999999999995,
    "medianResTime" : 20.5,
    "minResTime" : 16.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 24.0,
    "pct2ResTime" : 29.699999999999996,
    "pct3ResTime" : 30.0,
    "throughput" : 1.0559662090813093,
    "receivedKBytesPerSec" : 0.4748754289862724,
    "sentKBytesPerSec" : 0.6906575864572333
  },
  "12 GET Список групп" : {
    "transaction" : "12 GET Список групп",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.174999999999996,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 11.960000000000036,
    "throughput" : 10.409618487482433,
    "receivedKBytesPerSec" : 4.620793050278457,
    "sentKBytesPerSec" : 5.908271743090616
  },
  "01 POST Регистрация" : {
    "transaction" : "01 POST Регистрация",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 120.45,
    "medianResTime" : 119.0,
    "minResTime" : 114.0,
    "maxResTime" : 141.0,
    "pct1ResTime" : 129.10000000000002,
    "pct2ResTime" : 140.45,
    "pct3ResTime" : 141.0,
    "throughput" : 1.0489327109665914,
    "receivedKBytesPerSec" : 1.0757194203335605,
    "sentKBytesPerSec" : 0.3053582432999423
  }
}