src/Backend/jmeter/results/smoke-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 23,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 20.173913043478258,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 143.0,
    "pct1ResTime" : 51.800000000000026,
    "pct2ResTime" : 126.19999999999976,
    "pct3ResTime" : 143.0,
    "throughput" : 46.18473895582329,
    "receivedKBytesPerSec" : 30.783289407630523,
    "sentKBytesPerSec" : 26.702513177710845
  },
  "10 GET Список досок" : {
    "transaction" : "10 GET Список досок",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.4,
    "medianResTime" : 5.0,
    "minResTime" : 5.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 25.773195876288657,
    "receivedKBytesPerSec" : 25.894007731958762,
    "sentKBytesPerSec" : 14.472253543814432
  },
  "13 GET Профиль пользователя" : {
    "transaction" : "13 GET Профиль пользователя",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.2,
    "medianResTime" : 5.0,
    "minResTime" : 5.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 24.390243902439025,
    "receivedKBytesPerSec" : 10.837461890243903,
    "sentKBytesPerSec" : 13.83860518292683
  },
  "02 POST Вход" : {
    "transaction" : "02 POST Вход",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.0,
    "medianResTime" : 59.0,
    "minResTime" : 59.0,
    "maxResTime" : 59.0,
    "pct1ResTime" : 59.0,
    "pct2ResTime" : 59.0,
    "pct3ResTime" : 59.0,
    "throughput" : 16.949152542372882,
    "receivedKBytesPerSec" : 17.197431144067796,
    "sentKBytesPerSec" : 10.89115466101695
  },
  "11 POST Создание доски" : {
    "transaction" : "11 POST Создание доски",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 30.4,
    "medianResTime" : 27.0,
    "minResTime" : 26.0,
    "maxResTime" : 41.0,
    "pct1ResTime" : 41.0,
    "pct2ResTime" : 41.0,
    "pct3ResTime" : 41.0,
    "throughput" : 21.83406113537118,
    "receivedKBytesPerSec" : 14.772106986899562,
    "sentKBytesPerSec" : 14.158024017467248
  },
  "03 POST Создание группы (подготовка)" : {
    "transaction" : "03 POST Создание группы (подготовка)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.0,
    "medianResTime" : 26.0,
    "minResTime" : 26.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 26.0,
    "throughput" : 38.46153846153847,
    "receivedKBytesPerSec" : 17.27764423076923,
    "sentKBytesPerSec" : 25.052584134615387
  },
  "12 GET Список групп" : {
    "transaction" : "12 GET Список групп",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.2,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 24.390243902439025,
    "receivedKBytesPerSec" : 10.813643292682928,
    "sentKBytesPerSec" : 13.790967987804878
  },
  "01 POST Регистрация" : {
    "transaction" : "01 POST Регистрация",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 143.0,
    "medianResTime" : 143.0,
    "minResTime" : 143.0,
    "maxResTime" : 143.0,
    "pct1ResTime" : 143.0,
    "pct2ResTime" : 143.0,
    "pct3ResTime" : 143.0,
    "throughput" : 6.993006993006993,
    "receivedKBytesPerSec" : 7.143247377622378,
    "sentKBytesPerSec" : 2.0282451923076925
  }
}