src/Backend/jmeter/results/stress-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.948837209302319,
    "medianResTime" : 5.0,
    "minResTime" : 2.0,
    "maxResTime" : 178.0,
    "pct1ResTime" : 31.0,
    "pct2ResTime" : 47.94999999999982,
    "pct3ResTime" : 122.0,
    "throughput" : 416.0216718266254,
    "receivedKBytesPerSec" : 360.1595757546439,
    "sentKBytesPerSec" : 245.46591932928598
  },
  "10 GET Список досок" : {
    "transaction" : "10 GET Список досок",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.779000000000003,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 11.0,
    "throughput" : 99.58175662218682,
    "receivedKBytesPerSec" : 188.0682189491635,
    "sentKBytesPerSec" : 56.66435346544513
  },
  "13 GET Профиль пользователя" : {
    "transaction" : "13 GET Профиль пользователя",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.692000000000002,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 10.0,
    "throughput" : 99.70089730807577,
    "receivedKBytesPerSec" : 44.76317142323031,
    "sentKBytesPerSec" : 57.31633225324028
  },
  "02 POST Вход" : {
    "transaction" : "02 POST Вход",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 60.790000000000006,
    "medianResTime" : 58.0,
    "minResTime" : 54.0,
    "maxResTime" : 89.0,
    "pct1ResTime" : 70.0,
    "pct2ResTime" : 76.94999999999999,
    "pct3ResTime" : 88.99,
    "throughput" : 10.158472165786264,
    "receivedKBytesPerSec" : 10.430588270774075,
    "sentKBytesPerSec" : 6.622847673709875
  },
  "11 POST Создание доски" : {
    "transaction" : "11 POST Создание доски",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.579999999999988,
    "medianResTime" : 27.0,
    "minResTime" : 17.0,
    "maxResTime" : 81.0,
    "pct1ResTime" : 36.0,
    "pct2ResTime" : 38.0,
    "pct3ResTime" : 50.98000000000002,
    "throughput" : 99.45300845350572,
    "receivedKBytesPerSec" : 68.37656560790651,
    "sentKBytesPerSec" : 65.60431299726504
  },
  "03 POST Создание группы (подготовка)" : {
    "transaction" : "03 POST Создание группы (подготовка)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.289999999999996,
    "medianResTime" : 22.0,
    "minResTime" : 17.0,
    "maxResTime" : 62.0,
    "pct1ResTime" : 29.900000000000006,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 61.889999999999944,
    "throughput" : 10.19056353816366,
    "receivedKBytesPerSec" : 4.60595558825028,
    "sentKBytesPerSec" : 6.733335244063996
  },
  "12 GET Список групп" : {
    "transaction" : "12 GET Список групп",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.188000000000004,
    "medianResTime" : 5.0,
    "minResTime" : 2.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 11.0,
    "throughput" : 99.68102073365232,
    "receivedKBytesPerSec" : 44.477788265051835,
    "sentKBytesPerSec" : 57.11021605861244
  },
  "01 POST Регистрация" : {
    "transaction" : "01 POST Регистрация",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.33000000000003,
    "medianResTime" : 121.0,
    "minResTime" : 113.0,
    "maxResTime" : 178.0,
    "pct1ResTime" : 150.0,
    "pct2ResTime" : 154.89999999999998,
    "pct3ResTime" : 177.93999999999997,
    "throughput" : 10.046212577858148,
    "receivedKBytesPerSec" : 10.392728425758488,
    "sentKBytesPerSec" : 2.951467374924653
  }
}